app/views/posts/_form.html.erb

    <%= form.label :author_id %>
    <%= form.select :author_id, Author.all.collect {|author| [author.name, author.id]}, {}, {class: 'form-control'} %>
---
SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" ASC LIMIT $1  [["LIMIT", 1]]