app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Joao"], ["age", 32], ["created_at", "2018-04-05 22:08:25.015151"], ["updated_at", "2018-04-05 22:08:25.015151"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save