app/controllers/posts_controller.rb

  def homepage
    @posts = Post.all.order("created_at desc")
---
SELECT "posts".* FROM "posts" ORDER BY created_at desc

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("text", "subject", "title", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "teste"], ["subject", "gsfvjk"], ["title", "qa"], ["created_at", "2018-04-05 22:36:52.395498"], ["updated_at", "2018-04-05 22:36:52.395498"], ["author_id", 2]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "author_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["author_id", 1], ["updated_at", "2018-04-05 22:19:46.670478"], ["id", 1]]